app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("activity", "date", "duration", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["activity", "Running"], ["date", "2018-10-08"], ["duration", 120], ["created_at", "2018-10-03 09:24:37.430577"], ["updated_at", "2018-10-03 09:24:37.430577"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "activity" = ?, "date" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["activity", "Running"], ["date", "2018-10-13"], ["updated_at", "2018-10-03 10:24:24.061516"], ["id", 14]]